___

<a href='https://www.schoolofds.com'><center><img src='../schoolofds_logo.png'/></center></a>
___
<center><em>Content Copyright by School of Data Science #schoolofds</em></center>

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [29]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','GOOG','Insta','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [30]:
df = pd.DataFrame(data)

In [31]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    GOOG  Vanessa    124
4   Insta     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [32]:
df.groupby('Company')

You can save this object as a new variable:

In [33]:
by_comp = df.groupby("Company")

In [34]:
by_comp

And then call aggregate methods off the object:

In [27]:
df.Company.value_counts()

GOOG     3
FB       1
Insta    1
MSFT     1
Name: Company, dtype: int64

In [23]:
by_comp.count()

         Person  Sales
Company
FB            1      1
GOOG          3      3
Insta         1      1
MSFT          1      1

In [11]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [35]:
df.groupby('Company').sum()

         Sales
Company
FB         350
GOOG       444
Insta      243
MSFT       340

In [36]:
df.groupby('Company').count()

         Person  Sales
Company
FB            1      1
GOOG          3      3
Insta         1      1
MSFT          1      1

More examples of aggregate methods:

In [37]:
by_comp.std()

             Sales
Company
FB             NaN
GOOG     45.077711
Insta          NaN
MSFT           NaN

In [38]:
by_comp.min()

          Person  Sales
Company
FB         Sarah    350
GOOG     Charlie    120
Insta       Carl    243
MSFT         Amy    340

In [39]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG     Vanessa    200
Insta       Carl    243
MSFT         Amy    340

In [40]:
by_comp.count()

         Person  Sales
Company
FB            1      1
GOOG          3      3
Insta         1      1
MSFT          1      1

* Transpose rows to columns and vice versa

In [43]:
by_comp.describe().T

Company         FB        GOOG  Insta   MSFT
Sales count    1.0    3.000000    1.0    1.0
      mean   350.0  148.000000  243.0  340.0
      std      NaN   45.077711    NaN    NaN
      min    350.0  120.000000  243.0  340.0
      25%    350.0  122.000000  243.0  340.0
      50%    350.0  124.000000  243.0  340.0
      75%    350.0  162.000000  243.0  340.0
      max    350.0  200.000000  243.0  340.0

In [44]:
by_comp.describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        1.0  350.0        NaN  350.0  350.0  350.0  350.0  350.0
GOOG      3.0  148.0  45.077711  120.0  122.0  124.0  162.0  200.0
Insta     1.0  243.0        NaN  243.0  243.0  243.0  243.0  243.0
MSFT      1.0  340.0        NaN  340.0  340.0  340.0  340.0  340.0

In [45]:
by_comp.describe().transpose()['GOOG']

Sales  count      3.000000
       mean     148.000000
       std       45.077711
       min      120.000000
       25%      122.000000
       50%      124.000000
       75%      162.000000
       max      200.000000
Name: GOOG, dtype: float64

# Great Job!